<?php

return [
    'title' => 'ក្រុមហ៊ុន',
    'create' => 'បន្ថែម​ក្រុមហ៊ុន',
    'edit' => 'កែប្រែ​ក្រុមហ៊ុន',
    'fields' => [
        'company_code' => 'លេខ​កូដ​ក្រុមហ៊ុន',
        'name' => 'ឈ្មោះ​ក្រុមហ៊ុន',
        'legal_name' => 'ឈ្មោះ​ផ្លូវការ',
        'country' => 'ប្រទេស',
        'currency' => 'រូបិយប័ណ្ណ',
        'address' => 'អាសយដ្ឋាន',
        'website' => 'គេហទំព័រ',
        'tax_registration_no' => 'លេខ​ចុះ​បញ្ជី​ពន្ធ',
        'business_registration_no' => 'លេខ​ចុះ​បញ្ជី​អាជីវកម្ម',
        'fiscal_year_start_month' => 'ខែ​ចាប់​ផ្ដើម​ឆ្នាំ​ហិរញ្ញវត្ថុ',
        'payroll_cycle' => 'វដ្ត​ប្រាក់​ខែ',
        'phone' => 'ទូរស័ព្ទ',
        'email' => 'អ៊ីមែល',
        'logo' => 'រូប​សញ្ញា',
        'is_active' => 'សកម្ម?',
    ],
    'deleted' => 'ក្រុមហ៊ុន​ត្រូវ​បាន​លុប',
    'saved' => 'ក្រុមហ៊ុន​ត្រូវ​បាន​រក្សា​ទុក',
];
