<?php

return [

    /*
    |--------------------------------------------------------------------------
    | Password Reset Language Lines (Khmer)
    |--------------------------------------------------------------------------
    */

    'reset' => 'ពាក្យ​សម្ងាត់​របស់​អ្នក​ត្រូវ​បាន​កំណត់​ឡើង​វិញ​ហើយ។',
    'sent' => 'យើង​បាន​ផ្ញើ​តំណ​កំណត់​ឡើង​វិញ​ពាក្យ​សម្ងាត់​ទៅ​អ៊ីមែល​របស់​អ្នក។',
    'throttled' => 'សូម​រង់ចាំ​មុន​ពេល​ព្យាយាម​ម្ដង​ទៀត។',
    'token' => 'Token​ កំណត់​ឡើង​វិញ​នេះ​មិន​ត្រឹមត្រូវ​ទេ។',
    'user' => 'យើង​មិន​អាច​រក​ឃើញ​អ្នក​ប្រើ​ដែល​មាន​អាសយដ្ឋាន​អ៊ីមែល​នេះ​ទេ។',

];
