<?php

return [
    'title' => 'មុខ​តំណែង',
    'create' => 'បន្ថែម​មុខ​តំណែង',
    'edit' => 'កែប្រែ​មុខ​តំណែង',
    'fields' => [
        'company' => 'ក្រុមហ៊ុន',
        'department' => 'នាយកដ្ឋាន',
        'position_code' => 'លេខ​កូដ',
        'title' => 'ចំណង​ជើង',
        'level' => 'កម្រិត',
        'description' => 'ការ​ពណ៌នា',
        'is_managerial' => 'ជា​អ្នក​គ្រប់​គ្រង?',
        'is_active' => 'សកម្ម?',
    ],
    'deleted' => 'មុខ​តំណែង​ត្រូវ​បាន​លុប',
    'saved' => 'មុខ​តំណែង​ត្រូវ​បាន​រក្សា​ទុក',
];
