<?php

return [
    'title' => 'ថ្ងៃ​បុណ្យ​ជាតិ',
    'create' => 'បន្ថែម​ថ្ងៃ​បុណ្យ',
    'edit' => 'កែប្រែ​ថ្ងៃ​បុណ្យ',
    'fields' => [
        'company' => 'ក្រុមហ៊ុន',
        'country' => 'ប្រទេស',
        'name' => 'ឈ្មោះ',
        'holiday_date' => 'កាល​បរិច្ឆេទ',
        'is_paid' => 'បង់​ប្រាក់?',
        'is_recurring' => 'កើត​ឡើង​ប្រចាំ​ឆ្នាំ?',
        'description' => 'ការ​ពណ៌នា',
    ],
    'deleted' => 'ថ្ងៃ​បុណ្យ​ត្រូវ​បាន​លុប',
    'saved' => 'ថ្ងៃ​បុណ្យ​ត្រូវ​បាន​រក្សា​ទុក',
];
