<?php

return [
    'title' => 'អ្នក​ប្រើ​ប្រាស់',
    'create' => 'បន្ថែម​អ្នក​ប្រើ',
    'edit' => 'កែប្រែ​អ្នក​ប្រើ',
    'fields' => [
        'name' => 'ឈ្មោះ​ពេញ',
        'email' => 'អាសយដ្ឋាន​អ៊ីមែល',
        'username' => 'ឈ្មោះ​អ្នក​ប្រើ',
        'phone' => 'ទូរស័ព្ទ',
        'company' => 'ក្រុមហ៊ុន',
        'employee' => 'បុគ្គលិក​ភ្ជាប់',
        'linked_employee' => 'បុគ្គលិក​ភ្ជាប់',
        'password' => 'ពាក្យ​សម្ងាត់',
        'password_confirmation' => 'បញ្ជាក់​ពាក្យ​សម្ងាត់',
        'is_active' => 'សកម្ម?',
        'roles' => 'តួនាទី',
    ],
    'password_help' => 'ទុក​ទេរ​ដើម្បី​រក្សា​ពាក្យ​សម្ងាត់​ពាក់​ព័ន្ធ នៅ​ពេល​កែប្រែ។',
    'deleted' => 'អ្នក​ប្រើ​ត្រូវ​បាន​លុប',
    'saved' => 'អ្នក​ប្រើ​ត្រូវ​បាន​រក្សា​ទុក',
];
