<?php

return [

    /*
    |--------------------------------------------------------------------------
    | Validation Language Lines (Khmer)
    |--------------------------------------------------------------------------
    */

    'accepted' => 'ត្រូវ​តែ​យល់​ព្រម​លើ :attribute។',
    'accepted_if' => 'ត្រូវ​តែ​យល់​ព្រម​លើ :attribute នៅ​ពេល :other ស្មើ :value។',
    'active_url' => ':attribute ត្រូវ​តែ​ជា URL ដែល​ត្រឹមត្រូវ។',
    'after' => ':attribute ត្រូវ​តែ​ជា​កាល​បរិច្ឆេទ​ក្រោយ :date។',
    'after_or_equal' => ':attribute ត្រូវ​តែ​ជា​កាល​បរិច្ឆេទ​ក្រោយ ឬ​ស្មើ :date។',
    'alpha' => ':attribute ត្រូវ​តែ​មាន​តែ​អក្សរ។',
    'alpha_dash' => ':attribute ត្រូវ​តែ​មាន​តែ​អក្សរ លេខ ដាច់​ៗ និង​សញ្ញា​ដាច់។',
    'alpha_num' => ':attribute ត្រូវ​តែ​មាន​តែ​អក្សរ និង​លេខ។',
    'any_of' => ':attribute មិន​ត្រឹមត្រូវ​ទេ។',
    'array' => ':attribute ត្រូវ​តែ​ជា​បញ្ជី (array)។',
    'ascii' => ':attribute ត្រូវ​តែ​មាន​តែ​អក្សរ និង​សញ្ញា​មាត្រដ្ឋាន​មួយ​បៃ។',
    'before' => ':attribute ត្រូវ​តែ​ជា​កាល​បរិច្ឆេទ​មុន :date។',
    'before_or_equal' => ':attribute ត្រូវ​តែ​ជា​កាល​បរិច្ឆេទ​មុន ឬ​ស្មើ :date។',
    'between' => [
        'array' => ':attribute ត្រូវ​មាន​ធាតុ​ចន្លោះ :min និង :max។',
        'file' => ':attribute ត្រូវ​មាន​ទំហំ​ចន្លោះ :min និង :max គីឡូបៃ។',
        'numeric' => ':attribute ត្រូវ​មាន​តម្លៃ​ចន្លោះ :min និង :max។',
        'string' => ':attribute ត្រូវ​មាន​ចំនួន​អក្សរ​ចន្លោះ :min និង :max។',
    ],
    'boolean' => ':attribute ត្រូវ​តែ​ជា true ឬ false។',
    'can' => ':attribute មាន​តម្លៃ​ដែល​មិន​អនុញ្ញាត។',
    'confirmed' => 'ការ​បញ្ជាក់ :attribute មិន​ត្រឹមត្រូវ​ទេ។',
    'contains' => ':attribute ខ្វះ​តម្លៃ​ដែល​តម្រូវ។',
    'current_password' => 'ពាក្យ​សម្ងាត់​មិន​ត្រឹមត្រូវ​ទេ។',
    'date' => ':attribute ត្រូវ​តែ​ជា​កាល​បរិច្ឆេទ​ត្រឹមត្រូវ។',
    'date_equals' => ':attribute ត្រូវ​តែ​ជា​កាល​បរិច្ឆេទ​ស្មើ :date។',
    'date_format' => ':attribute ត្រូវ​តែ​ត្រូវ​នឹង​ទម្រង់ :format។',
    'decimal' => ':attribute ត្រូវ​មាន :decimal ខ្ទង់​ទសភាគ។',
    'declined' => ':attribute ត្រូវ​តែ​បដិសេធ។',
    'declined_if' => ':attribute ត្រូវ​តែ​បដិសេធ នៅ​ពេល :other ស្មើ :value។',
    'different' => ':attribute និង :other ត្រូវ​តែ​ខុស​គ្នា។',
    'digits' => ':attribute ត្រូវ​មាន :digits ខ្ទង់។',
    'digits_between' => ':attribute ត្រូវ​មាន​ចន្លោះ :min និង :max ខ្ទង់។',
    'dimensions' => ':attribute មាន​វិមាត្រ​រូបភាព​មិន​ត្រឹមត្រូវ។',
    'distinct' => ':attribute មាន​តម្លៃ​ស្ទួន។',
    'doesnt_contain' => 'វាល :attribute ត្រូវ​មិន​មាន​ផ្ទុក​មួយ​ក្នុង​ចំណោម៖ :values។',
    'doesnt_end_with' => ':attribute មិន​ត្រូវ​បញ្ចប់​ដោយ​មួយ​ក្នុង​ចំណោម​នេះ៖ :values។',
    'doesnt_start_with' => ':attribute មិន​ត្រូវ​ចាប់​ផ្តើម​ដោយ​មួយ​ក្នុង​ចំណោម​នេះ៖ :values។',
    'email' => ':attribute ត្រូវ​តែ​ជា​អ៊ីមែល​ត្រឹមត្រូវ។',
    'encoding' => 'វាល :attribute ត្រូវ​បាន​អ៊ិនកូដ​ក្នុង :encoding។',
    'ends_with' => ':attribute ត្រូវ​បញ្ចប់​ដោយ​មួយ​ក្នុង​ចំណោម៖ :values។',
    'enum' => 'ការ​ជ្រើស​រើស :attribute មិន​ត្រឹមត្រូវ​ទេ។',
    'exists' => 'ការ​ជ្រើស​រើស :attribute មិន​ត្រឹមត្រូវ​ទេ។',
    'extensions' => ':attribute ត្រូវ​មាន​កន្ទុយ​ឯកសារ​មួយ​ក្នុង​ចំណោម៖ :values។',
    'file' => ':attribute ត្រូវ​តែ​ជា​ឯកសារ។',
    'filled' => ':attribute ត្រូវ​មាន​តម្លៃ។',
    'gt' => [
        'array' => ':attribute ត្រូវ​មាន​ច្រើន​ជាង :value ធាតុ។',
        'file' => ':attribute ត្រូវ​មាន​ទំហំ​ធំ​ជាង :value គីឡូបៃ។',
        'numeric' => ':attribute ត្រូវ​ធំ​ជាង :value។',
        'string' => ':attribute ត្រូវ​មាន​អក្សរ​ច្រើន​ជាង :value។',
    ],
    'gte' => [
        'array' => ':attribute ត្រូវ​មាន :value ធាតុ​ឬ​ច្រើន​ជាង។',
        'file' => ':attribute ត្រូវ​មាន​ទំហំ :value គីឡូបៃ​ឬ​ធំ​ជាង។',
        'numeric' => ':attribute ត្រូវ​ធំ​ឬ​ស្មើ :value។',
        'string' => ':attribute ត្រូវ​មាន​អក្សរ :value ឬ​ច្រើន​ជាង។',
    ],
    'hex_color' => ':attribute ត្រូវ​តែ​ជា​ពណ៌ hex ត្រឹមត្រូវ។',
    'image' => ':attribute ត្រូវ​តែ​ជា​រូបភាព។',
    'in' => 'ការ​ជ្រើស​រើស :attribute មិន​ត្រឹមត្រូវ​ទេ។',
    'in_array' => ':attribute ត្រូវ​មាន​នៅ​ក្នុង :other។',
    'in_array_keys' => ':attribute ត្រូវ​មាន​យ៉ាង​ហោច​ណាស់​មួយ​ក្នុង​ចំណោម​សោ​ខាង​ក្រោម៖ :values។',
    'integer' => ':attribute ត្រូវ​តែ​ជា​ចំនួន​គត់។',
    'ip' => ':attribute ត្រូវ​តែ​ជា​អាសយដ្ឋាន IP ត្រឹមត្រូវ។',
    'ipv4' => ':attribute ត្រូវ​តែ​ជា IPv4 ត្រឹមត្រូវ។',
    'ipv6' => ':attribute ត្រូវ​តែ​ជា IPv6 ត្រឹមត្រូវ។',
    'json' => ':attribute ត្រូវ​តែ​ជា JSON ត្រឹមត្រូវ។',
    'list' => ':attribute ត្រូវ​តែ​ជា​បញ្ជី។',
    'lt' => [
        'array' => ':attribute ត្រូវ​មាន​តិច​ជាង :value ធាតុ។',
        'file' => ':attribute ត្រូវ​មាន​ទំហំ​តូច​ជាង :value គីឡូបៃ។',
        'numeric' => ':attribute ត្រូវ​តូច​ជាង :value។',
        'string' => ':attribute ត្រូវ​មាន​អក្សរ​តិច​ជាង :value។',
    ],
    'lte' => [
        'array' => ':attribute មិន​ត្រូវ​មាន​ច្រើន​ជាង :value ធាតុ​ទេ។',
        'file' => ':attribute ត្រូវ​មាន​ទំហំ :value គីឡូបៃ​ឬ​តូច​ជាង។',
        'numeric' => ':attribute ត្រូវ​តូច​ឬ​ស្មើ :value។',
        'string' => ':attribute ត្រូវ​មាន​អក្សរ :value ឬ​តិច​ជាង។',
    ],
    'lowercase' => ':attribute ត្រូវ​មាន​តែ​អក្សរ​តូច។',
    'mac_address' => ':attribute ត្រូវ​តែ​ជា MAC ត្រឹមត្រូវ។',
    'max' => [
        'array' => ':attribute មិន​ត្រូវ​មាន​ច្រើន​ជាង :max ធាតុ​ទេ។',
        'file' => ':attribute មិន​ត្រូវ​ធំ​ជាង :max គីឡូបៃ​ទេ។',
        'numeric' => ':attribute មិន​ត្រូវ​ធំ​ជាង :max ទេ។',
        'string' => ':attribute មិន​ត្រូវ​មាន​អក្សរ​ច្រើន​ជាង :max ទេ។',
    ],
    'max_digits' => ':attribute ត្រូវ​មាន​មិន​លើស​ពី :max ខ្ទង់។',
    'mimes' => ':attribute ត្រូវ​តែ​ជា​ឯកសារ​ប្រភេទ៖ :values។',
    'mimetypes' => ':attribute ត្រូវ​តែ​ជា​ឯកសារ​ប្រភេទ៖ :values។',
    'min' => [
        'array' => ':attribute ត្រូវ​មាន​យ៉ាង​ហោច​ណាស់ :min ធាតុ។',
        'file' => ':attribute ត្រូវ​មាន​ទំហំ​យ៉ាង​ហោច​ណាស់ :min គីឡូបៃ។',
        'numeric' => ':attribute ត្រូវ​មាន​យ៉ាង​ហោច​ណាស់ :min។',
        'string' => ':attribute ត្រូវ​មាន​អក្សរ​យ៉ាង​ហោច​ណាស់ :min។',
    ],
    'min_digits' => ':attribute ត្រូវ​មាន​យ៉ាង​ហោច​ណាស់ :min ខ្ទង់។',
    'missing' => 'វាល :attribute ត្រូវ​តែ​អត់​មាន។',
    'missing_if' => 'វាល :attribute ត្រូវ​តែ​អត់​មាន នៅ​ពេល :other ស្មើ :value។',
    'missing_unless' => 'វាល :attribute ត្រូវ​តែ​អត់​មាន លុះត្រា :other ស្មើ :value។',
    'missing_with' => 'វាល :attribute ត្រូវ​តែ​អត់​មាន នៅ​ពេល :values មាន។',
    'missing_with_all' => 'វាល :attribute ត្រូវ​តែ​អត់​មាន នៅ​ពេល :values ទាំងអស់​មាន។',
    'multiple_of' => ':attribute ត្រូវ​តែ​ជា​ផល​គុណ​នៃ :value។',
    'not_in' => 'ការ​ជ្រើស​រើស :attribute មិន​ត្រឹមត្រូវ​ទេ។',
    'not_regex' => 'ទម្រង់ :attribute មិន​ត្រឹមត្រូវ​ទេ។',
    'numeric' => ':attribute ត្រូវ​តែ​ជា​លេខ។',
    'password' => [
        'letters' => ':attribute ត្រូវ​មាន​យ៉ាង​ហោច​ណាស់​មួយ​អក្សរ។',
        'mixed' => ':attribute ត្រូវ​មាន​យ៉ាង​ហោច​ណាស់​មួយ​អក្សរ​ធំ និង​មួយ​អក្សរ​តូច។',
        'numbers' => ':attribute ត្រូវ​មាន​យ៉ាង​ហោច​ណាស់​មួយ​លេខ។',
        'symbols' => ':attribute ត្រូវ​មាន​យ៉ាង​ហោច​ណាស់​មួយ​សញ្ញា​ពិសេស។',
        'uncompromised' => ':attribute ត្រូវ​បាន​លេចធ្លាយ​មក​ហើយ។ សូម​ជ្រើស​យក​ពាក្យ​ផ្សេង។',
    ],
    'present' => 'វាល :attribute ត្រូវ​មាន​វត្តមាន។',
    'present_if' => 'វាល :attribute ត្រូវ​មាន​វត្តមាន នៅ​ពេល :other ស្មើ :value។',
    'present_unless' => 'វាល :attribute ត្រូវ​មាន​វត្តមាន លុះត្រា :other ស្មើ :value។',
    'present_with' => 'វាល :attribute ត្រូវ​មាន​វត្តមាន នៅ​ពេល :values មាន។',
    'present_with_all' => 'វាល :attribute ត្រូវ​មាន​វត្តមាន នៅ​ពេល :values ទាំងអស់​មាន។',
    'prohibited' => ':attribute ត្រូវ​បាន​ហាមប្រាម។',
    'prohibited_if' => ':attribute ត្រូវ​បាន​ហាមប្រាម នៅ​ពេល :other ស្មើ :value។',
    'prohibited_if_accepted' => ':attribute ត្រូវ​បាន​ហាមប្រាម នៅ​ពេល :other ត្រូវ​បាន​យល់​ព្រម។',
    'prohibited_if_declined' => ':attribute ត្រូវ​បាន​ហាមប្រាម នៅ​ពេល :other ត្រូវ​បាន​បដិសេធ។',
    'prohibited_unless' => ':attribute ត្រូវ​បាន​ហាមប្រាម លុះត្រា :other ស្ថិត​នៅ​ក្នុង​ :values។',
    'prohibits' => ':attribute ហាមប្រាម​មិន​ឲ្យ :other មាន​វត្តមាន។',
    'regex' => 'ទម្រង់ :attribute មិន​ត្រឹមត្រូវ​ទេ។',
    'required' => 'វាល :attribute ត្រូវ​បំពេញ។',
    'required_array_keys' => 'វាល :attribute ត្រូវ​មាន​សោ៖ :values។',
    'required_if' => 'វាល :attribute ត្រូវ​បំពេញ នៅ​ពេល :other ស្មើ :value។',
    'required_if_accepted' => 'វាល :attribute ត្រូវ​បំពេញ នៅ​ពេល :other ត្រូវ​បាន​យល់​ព្រម។',
    'required_if_declined' => 'វាល :attribute ត្រូវ​បំពេញ នៅ​ពេល :other ត្រូវ​បាន​បដិសេធ។',
    'required_unless' => 'វាល :attribute ត្រូវ​បំពេញ លុះត្រា :other ស្ថិត​នៅ​ក្នុង :values។',
    'required_with' => 'វាល :attribute ត្រូវ​បំពេញ នៅ​ពេល :values មាន។',
    'required_with_all' => 'វាល :attribute ត្រូវ​បំពេញ នៅ​ពេល :values ទាំងអស់​មាន។',
    'required_without' => 'វាល :attribute ត្រូវ​បំពេញ នៅ​ពេល :values មិន​មាន។',
    'required_without_all' => 'វាល :attribute ត្រូវ​បំពេញ នៅ​ពេល :values ទាំងអស់​មិន​មាន។',
    'same' => ':attribute និង :other ត្រូវ​ផ្គូផ្គង។',
    'size' => [
        'array' => ':attribute ត្រូវ​មាន :size ធាតុ។',
        'file' => ':attribute ត្រូវ​មាន​ទំហំ :size គីឡូបៃ។',
        'numeric' => ':attribute ត្រូវ​ស្មើ :size។',
        'string' => ':attribute ត្រូវ​មាន :size អក្សរ។',
    ],
    'starts_with' => ':attribute ត្រូវ​ចាប់​ផ្តើម​ដោយ​មួយ​ក្នុង​ចំណោម៖ :values។',
    'string' => ':attribute ត្រូវ​តែ​ជា​អក្សរ។',
    'timezone' => ':attribute ត្រូវ​តែ​ជា​តំបន់​ពេលវេលា​ត្រឹមត្រូវ។',
    'unique' => ':attribute ត្រូវ​បាន​ប្រើ​រួច​ហើយ។',
    'uploaded' => ':attribute មិន​អាច​ផ្ទុក​ឡើង​បាន​ទេ។',
    'uppercase' => ':attribute ត្រូវ​មាន​តែ​អក្សរ​ធំ។',
    'url' => ':attribute ត្រូវ​តែ​ជា URL ត្រឹមត្រូវ។',
    'ulid' => ':attribute ត្រូវ​តែ​ជា ULID ត្រឹមត្រូវ។',
    'uuid' => ':attribute ត្រូវ​តែ​ជា UUID ត្រឹមត្រូវ។',

    /*
    |--------------------------------------------------------------------------
    | Custom Validation Language Lines
    |--------------------------------------------------------------------------
    */

    'custom' => [
        'attribute-name' => [
            'rule-name' => 'custom-message',
        ],
    ],

    /*
    |--------------------------------------------------------------------------
    | Custom Validation Attributes
    |--------------------------------------------------------------------------
    */

    'attributes' => [],

];
